{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,2],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"dense_Dense5","class_name":"Dense","config":{"units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"dense_Dense6","class_name":"Dense","config":{"units":49,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true},"inbound_nodes":[[["dense_Dense5",0,0,{}]]]},{"name":"dense_Dense7","class_name":"Dense","config":{"units":196,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true},"inbound_nodes":[[["dense_Dense6",0,0,{}]]]},{"name":"dense_Dense8","class_name":"Dense","config":{"units":784,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true},"inbound_nodes":[[["dense_Dense7",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["dense_Dense8",0,0]]},"keras_version":"tfjs-layers 2.7.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense5/kernel","shape":[2,10],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[10],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[10,49],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[49],"dtype":"float32"},{"name":"dense_Dense7/kernel","shape":[49,196],"dtype":"float32"},{"name":"dense_Dense7/bias","shape":[196],"dtype":"float32"},{"name":"dense_Dense8/kernel","shape":[196,784],"dtype":"float32"},{"name":"dense_Dense8/bias","shape":[784],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.7.0","convertedBy":null}